/*
  Localizable.strings
  DevToys

  Created by yuki on 2022/02/13.
  
*/

// - General -
"Configuration" = "Configuration";
"Format" = "Format";
"Pretty" = "Pretty";
"Minified" = "Minified";
"Encoded" = "Encoded";
"Decoded" = "Decoded";
"File" = "File";
"Text" = "Text";
"Copy" = "Copy";
"Paste" = "Paste";
"Copied!" = "Copied!";
"Pasted!" = "Pasted";
"Open" = "Open";
"Export" = "Export";
"Import" = "Import";
"Input" = "Input";
"Output" = "Output";
"No selection" = "No selection";
"Drop Files Here" = "Drop Files Here";
"Untitled Tool" = "Untitled Tool";
"Uppercase" = "Uppercase";
"Hyphens" = "Hyphens";
"Type" = "Type";
"Length" = "Length";
"Convert" = "Convert";
"Information" = "Information";
"Clear" = "Clear";
"Delete" = "Delete";
"Open in Finder" = "Open in Finder";
"Quick Look" = "Quick Look";
"Default" = "Default";

// - Category -
"category.home" = "Home";
"category.converters" = "Converters";
"category.encoders_decoders" = "Encoders / Decoders";
"category.formatters" = "Formatters";
"category.generators" = "Generators";
"category.text" = "Text";
"category.graphic" = "Graphic";
"Media" = "Media";

// - Tool -
"tool.home.title" = "Home";
"tool.home.mintitle" = "Home";
"tool.home.description" = "Search all tools here.";

"tool.jsonyaml.title" = "JSON <> Yaml Converter";
"tool.jsonyaml.mintitle" = "JSON <> Yaml";
"tool.jsonyaml.description" = "Convert Json data to Yaml and vice versa";

"tool.numbase.title" = "Number Base Converter";
"tool.numbase.mintitle" = "Number Base";
"tool.numbase.description" = "Convert numbers from one base to another";
"Format Number" = "Format Number";
"Decimal" = "Decimal";
"Hexdecimal" = "Hexadecimal";
"Octal" = "Octal";
"Binary" = "Binary";

"tool.date.title" = "Date Converter";
"tool.date.mintitle" = "Date";
"tool.date.description" = "Converts date from one format to another";
"Now" = "Now";
"Date" = "Date";
"Unix Time" = "Unix Time";
"ISO 8601" = "ISO 8601";
"Calender" = "Calender";

"tool.html.title" = "HTML Encoder / Decoder";
"tool.html.mintitle" = "HTML";
"tool.html.description" = "Encoder or decoder all the applicable characters to their corresponding HTML";

"tool.url.title" = "URL Encoder / Decoder";
"tool.url.mintitle" = "URL";
"tool.url.description" = "Encoder or decode all the applicable characters to their corresponding URL";

"tool.base64.title" = "Base64 Encoder / Decoder";
"tool.base64.mintitle" = "Base64";
"tool.base64.description" = "Encode and decode Base64 data";
"Source Type" = "Source Type";
"Text Source" = "Text Source";
"File Source" = "File Source";

"tool.jwt.title" = "JWT Encoder / Decoder";
"tool.jwt.mintitle" = "JWT";
"tool.jwt.description" = "Decode a JWT header playload and signature";
"JWT Token" = "JWT Token";
"Header" = "Header";
"Payload" = "Payload";

"tool.jsonformat.title" = "JSON Formatter";
"tool.jsonformat.mintitle" = "JSON";
"tool.jsonformat.description" = "Indent or minify Json data";
"Indentation" = "Indentation";
"2 Spaces" = "2 Spaces";
"4 Spaces" = "4 Spaces";
"1 Tab" = "1 Tab";

"tool.xmlformat.title" = "XML Formatter";
"tool.xmlformat.mintitle" = "XML";
"tool.xmlformat.description" = "Indent or minify XML data";
"HTML Document" = "HTML Document";
"XML Document" = "XML Document";
"Document Type" = "Document Type";
"Auto Fix Document" = "Auto Fix Document";
"Pretty Document" = "Pretty Document";

"tool.hashgen.title" = "Hash Generator";
"tool.hashgen.mintitle" = "Hash";
"tool.hashgen.description" = "Calculate MD5, SHA1, SHA256 and SHA 512 hash from text data";

"tool.uuidgen.title" = "UUID Generator";
"tool.uuidgen.mintitle" = "UUID";
"tool.uuidgen.description" = "Generate UUIDs";
"Generate UUIDs" = "Generate UUIDs";

"tool.ligen.title" = "Lorem Ipsum Generator";
"tool.ligen.mintitle" = "Lorem Ipsum";
"tool.ligen.description" = "Generate Lorem Ipsum placeholder text";
"Type of generating Lorem Ipsum" = "Type of generating Lorem Ipsum";
"Length of generating Lorem Ipsum" = "Length of generating Lorem Ipsum";
"Words" = "Words";
"Sentences" = "Sentences";
"Paragraphs" = "Paragraphs";

"tool.checksum.title" = "Checksum Generator";
"tool.checksum.mintitle" = "Checksum";
"tool.checksum.description" = "Generate or Test checksum of a file";
"Output Comparer" = "Output Comparer";
"Hash Algorithm" = "Hash Algorithm";
"Select which algorithm you want to use" = "Select which algorithm you want to use";

"tool.checksum.title" = "Checksum Generator";
"tool.checksum.mintitle" = "Checksum";
"tool.checksum.description" = "Generate or Test checksum of a file";

"tool.textinspect.title" = "Text Inspector & Case Converter";
"tool.textinspect.mintitle" = "Inspector & Case Converter";
"tool.textinspect.description" = "Analyze text and convert it to different case";
"Charactors" = "Characters";
"Words" = "Words";
"Lines" = "Lines";
"Bytes" = "Bytes";

"tool.regex.title" = "Regex Tester";
"tool.regex.mintitle" = "Regex";
"tool.regex.description" = "Test regular expression";
"Reguler expression" = "Regular expression";

"tool.hyphenremove.title" = "Hyphenation Remover";
"tool.hyphenremove.mintitle" = "Hyphenation";
"tool.hyphenremove.description" = "Remove hyphenations copied from PDF text";

"tool.imageoptim.title" = "PNG / JPEG Compressor";
"tool.imageoptim.mintitle" = "PNG / JPEG Compressor";
"tool.imageoptim.description" = "Lossless PNG and JPEG optimizer";
"Optimize Level" = "Optimize Level";
"Low" = "Low";
"Medium" = "Medium";
"High" = "High";
"Very High (Slow)" = "Very High (Slow)";
"Override original file" = "Override original file";

"tool.pdfgen.title" = "PDF Generator";
"tool.pdfgen.mintitle" = "PDF Generator";
"tool.pdfgen.description" = "Generate PDF from multiple images";
"Images" = "Images";
"Size" = "Size";
"Generate PDF" = "Generate PDF";
"Page" = "Page";

"tool.imageconvert.title" = "Image Converter";
"tool.imageconvert.mintitle" = "Image Converter";
"tool.imageconvert.description" = "Convert or Resize images";
"PNG Format" = "PNG Format";
"JPEG Format" = "JPEG Format";
"TIFF Format" = "TIFF Format";
"GIF Format" = "GIF Format";
"Scale to Fill" = "Scale to Fill";
"Scale to Fit" = "Scale to Fit";
"Image Format" = "Image Format";
"Resize" = "Resize";
"Converted Images" = "Converted Images";
"Scale" = "Scale";
"Size" = "Size";

"QR Code Generator" = "QR Code Generator";
"Create a QR code from text" = "Create a QR code from text";
"Correction Level" = "Correction Level";
"QR Code" = "QR Code";

"Settings" = "Settings";
"Setting of application" = "Setting of application";
"App Theme" = "App Theme";
"Select which app theme to display" = "Select which app theme to display";
"Use system setting" = "Use system setting";
"Light mode" = "Light mode";
"Dark mode" = "Dark mode";

"Color Picker" = "Color Picker";
"Picker the color and copy components" = "Pick a color and copy the formatted color";
"HSB Box" = "HSB Box";
"HSB Circle" = "HSB Circle";
"HSB Circle and Bars" = "HSB Circle and Bars";
"Pick Color" = "Pick Color";
"Picker Type" = "Picker Type";
"Color Hex" = "Color Hex";
"Color Copy" = "Color Copy";
"Color Copy Type" = "Type";

"Gif Converter" = "Gif Converter";
"Convert a movie to an animated GIF file" = "Convert a movie to an animated GIF file";
"Width" = "Width";
"The width of the Gif file" = "The width of the Gif file (height will be determined)";
"FPS" = "FPS";
"FPS of the Gif file to be exported" = "FPS of the Gif file to be exported";
"Remove source file" = "Remove source file";
"Whether to delete the source file after exporting a Gif" = "Whether to delete the source file after exporting a Gif";

"Audio Converter" = "Audio Converter";
"Convert audio from one format to another" = "Convert audio from one format to another";
"Whether to delete the source file after exporting a Audio" = "Whether to delete the source file after exporting a Audio";
"Starting..." = "Starting...";
"Complete" = "Complete";
"Convert Failed" = "Convert Failed";

"Text Diff" = "Text Diff";
"Compare two Text and display Diff" = "Compare two Text and display Diff";
"By Characters" = "Characters";
"By Words" = "Words";
"By Lines" = "Lines";
"Input 1" = "Input 1";
"Input 2" = "Input 2";
"Diff Style" = "Diff Style";
